{
  "predict": {
    "traces": [],
    "train": [],
    "demos": [
      {
        "transcript_chunk": ". That's a drone. They're\n\nSo\n\nBad. Put in my yard by China.\n\nMy husband is probably dying out there that I even brought this. He's like, are you talking my soup? Our chicken. So I'm just being there. He's like cooking and I'm just like, I'm painting my chickens right now. Always\n\nChickens.\n\nI don't know why. I have no idea. It's easy. That's why. Fate. It's\n\nFate. You're designed to be the greatest folk. Art chicken.\n\nThat's my next song. Folk art. Fake painter\n\nOf all time. Folk art fate. Imagine if that's what it is. Like there's something that compelling. You tell the world about chicken folk art.\n\nI guess. So. Here\n\nWe go. You watch chick. Do you have chickens?\n\nYeah, I do have chickens. I have\n\nChickens.\n\nI love chickens.\n\nChickens are great.\n\nRight? They're awesome.\n\nThey're really cute. They're the ladies. I go in the yard like, hi\n\nLadies. The ladies. That's why I call 'em. I say, Hey ladies, I give them all the scraps. They love everything from the table. Like any leftovers. It's funny to watch 'em though 'cause they're like picky. Like the other day I thought they would eat like leftover breakfast. Casserole wouldn't touch it really? But they were all, they didn't eat the biscuits. Chickens don't like biscuits.\n\nWell, maybe they know that breakfast casserole is eggs and they're like, Jesus Christ, this lady's fucking nuts. She's trying to turned us into cannibals.\n\nRidiculous. Because I didn't think about that.\n\nRight. Maybe it's like,\n\nOh no, what have I done to my ladies?\n\nIt might be like a natural reaction to them. I'll tell you what they go crazy for is mice. Have you ever seen what, oh yeah. Yeah. So this is how I found out. I used to have a house in California that my wife, she changed our back fence. It was a wrought iron fence. And she changed it to glass. And when she did, she, she signed a death warrant for a bunch of hawks. And they kept slamming into that fucking glass. And like three of them died in our yard. And one of them got kd but survived. And I was on the road and she had told me about it. And they'd taken this, this hawk and they had put it in a box. And when I got back we got 'em what's called pinkies. And what pinkies are, are these little baby mice that have, they feed 'em to lizards and snakes. Like that's what they're for. Like when you go to the pet store, they sell you these things. They're not weaned from their mother. And you feed 'em the snakes. I know it's dark. So they, they bought a bunch of 'em and fed this hawk, these little baby mice. And it ate all of them except one. And my daughters were very young at the time and they're like, we wanna keep that mouse. We wanna raise it. I'm like, honey, you can't, it's not gonna live. Like it's not weaned from its mother. It won't survive. I go, I'm just gonna go see if the chickens will eat it. I put this thing down and these chickens attacked like they were raptors from Jurassic Park. One chicken grabbed it and they all chased her around. They were\n\nStealing it from what in the world are you saying?\n\nPulling it out of her mouth? It is the, they are so ferocious. Like you've never seen anything like a chicken with a mouse.\n\nI have never heard this in my life.\n\nI'm gonna show you a video. And this video, oh, do I wanna see this? There's a bunch of videos of cats with mice. So, so this is a mouse. And why, why do these chickens? My god. They just kill this mouse. And look, they all attack each other trying to steal the mouse away from the one chicken. And has it, do they eat? Oh, they eat it quick. Yeah, they devour it. Hmm. So there's another mouse in there that they don't know about yet. So see there's one with a cat. So the cat is playing with the, the mouse. Like, you know, cats don't kill it or an they wanna play. And this chicken just runs over and snatches it from the cat. Like,\n\nFuck you. I have never heard this in my life. So\n\nLook, the cat has a mouse and chicken's like, gimme that bitch. They just go, look, it's got a mouse. And the cat's like, Jesus Christ, you guys are psychos.\n\nWell, who knew? Yeah.\n\nWell because they're dinosaurs. That's who they are. They're just dinosaurs that are really small that survive the impact of the asteroid.\n\nI also love dinosaurs, so maybe that's why. That's it. Chickens. I'm called to paint my folk chicken.\n\nYou just don't realize how ruthless they are until\n\nYou see, I've never heard this in my life. This is blowing 'em. I'm country as a bump. And like I've never heard this. They\n\nDestroy mice. Yeah. Dang. Destroy 'em. They love 'em. They tear 'em apart.\n\nWell, I'm not gonna go do that, but I'm glad I know that now.\n\nLike nothing I've ever seen before. We also saw a mouse that got loose in the chicken coop once they, we had a big chicken coop and a mouse went in there and I saw these chickens just tear that mouse\n\nUp. Well the ma casserole is not offensive to them\n\nEating their own babies.\n\nThey're not, we don't have a rooster.\n\nWell I know, but they don't know that you're right. You know, they brooded sometimes\n\nI think baby know. I just let 'em sometimes. And I'm like, do you? Well I just like, sometimes they look at me like, let me just sit on this. Like, like, okay, you can have it. That's your egg out.\n\nYeah. But they pluck their feathers out.\n\nI know. They, it's a lot.\n\nThey get real. They get real. It, it makes you sad. It's like they wanna be a mommy. They do. Yeah. And you don't let 'em, we had a rooster once, but he did not last.\n\nI do not enjoy having roosters. They're roosters soul\n\nFuckers. They're me. Yeah. He attacked my wife and she's like, we're done. Me\n\nToo. Mine attack me. I'm out on rooster.\n\nYeah, they're they're assholes. Yeah. And but they're doing it because they're trying to protect their hens. Like they don't know that you're okay. No, they just think this big fucking thing is moving around their hens. Like this giant person\n\nThing. They're also mean to the hint. Real mean. They're they're mean brutal. Ripping their feathers out. I'm like, I can't do it.\n\nYeah. They're nasty. They're,\n\nHow many do y'all have? Chickens?\n\nWe have 15. 15 or\n\n16. Y'all name 'em.\n\nYes. I don't name 'em, but my daughter girls and my wife names them. But the rooster, he, we only let him got, he got to maturity and then we gave him to a friend. We're like, this motherfucker can't, no, I was gonna kill him. They're mean.\n\nYeah.\n\nHe attacked me. I went into the, I was like, you just gotta like, show him who's boss. And he is like, no, no, you're not boss. I'll attack you too, bitch. Yeah, exactly. He attacked me and I was like, bitch, like it. I'll fucking kill you. And so to avoid killing him, I gave him away. Well that's good because I was totally ready to kill him. Yeah. Because when I'd go in there, he'd face off against me and just leap at me and\n\nAt\n\nMe. Every\n\nYeah. Might, might attack me too. And dad dealt with it. I don't know what happened to him, but dad dealt with it.\n\nSoup. Turned with the soup. Yeah. That's the thing about roosters too. I guess he can't like just outright eat 'em. They're really tough. So if you do kill 'em, you gotta like, either slow cook 'em or turn 'em into soup.\n\nWell we, we probably did. He didn't tell me\n\nI had a landscaper back when I lived in LA who he used to fight chickens and he took me over his place once.\n\nI hate that.\n\nIt was crazy.\n\nI hate it. Yeah.\n\nHe had like a hundred, a hundred roosters.\n\nWe have done some boxers my nation has done. We're not just, we don't just help dogs. We help all animals. But dogs are focused. But like we've helped break up some chicken rings the past. It's\n\nKind of the crazy that it's still, it's still around.\n\nIt's awful. There's some, it's always out. Like we have a farm in Tennessee and there's a whole, this is whole farm like down the road and it's, they keep him in tiny cages. I just hate it. And every time we report him, every time they just pay the fine. You know what I mean?\n\nWell, it's a part of the culture that's the problem. And they all gamble on it. I know he was Mexican and you know, from Mexico and he had all these friends that lived in this neighborhood where he lived in like, you might as well have been in Mexico. It was crazy. Everything was in Spanish. And when I went over his place, it's like his buddy, we went over his buddy's place. His buddy had like a hundred cages in the backyard in a pit where they would take the roosters. Awful. Yeah. And they put spurs on 'em. So they put\n\nThese like, it's so terrible. I mean, knives\n\nOn their claws.\n\nWe, we try to like, we got to be part of like some of the But when you confiscate like that many they use mean Yeah. I mean you can't Yeah. And reintroduce them into the world. Like Right. You know what I mean? They're taught to be mean. They're bred for that.\n\nYeah. And they'll br they'll breed champion roosters from champion other roosters.\n\nLet's just stick to our little backyard hens. How about that?\n\nYeah. It's just, it's a weird thing because like their, their culture has been, they fight them and then they take the loser and they cook 'em. Yeah. And you know, he was making it seem like it was no big deal. And it was like, to them it was their gambling recreation. Yeah. They would all gather around and guys would come from long distances to bring their chickens to fight.\n\nI hate it.\n\nYeah. To me it doesn't freak me out as much as dog fighting. Dog fighting drives me nuts. 'cause pit bulls are the, they're look, they're very dangerous because they have a very high parade drive and they often don't, they confuse children with other animals. They don't. But as pets, they are the most loyal. They're just, they're the most\n\nLoving,\n\nThey're sweetest\n\nKind.\n\nThey love you to death. They love you so much. But there's so many bad ones and so many ones that are raised just to fight. And that part of our culture, that part of society, like the the underground dog fighting part is like, how can you do that to a dog? Like how can you do that to the best animals? Yeah. It's the scum\n\nOf the earth is what it is. I feel like I have some friends that are huge into pit bull rescue and when they're either rehabilitated or just they get a bad rap period. Right. Like, like say any, any metro shelter you go to, it's 90% pit bulls because people are afraid. Yeah. But they're, they get such a bad reputation. But there are some amazing pities that weren't ever in the fighting greens. Right. They were just overbred and you know, you know, taking it out of a confiscation of a, of a hoarding situation or breaking up the fighting rings and it's the mama dog that's just been having puppies and like Yeah. I just wish people would at least open their minds and hearts to like, there are some amazing pities out there or pity mixes. You know, there\n\nAre, but there are also very dangerous. I\n\nGet it. I know they are. They\n\nGo around other dogs. They will fight those dogs to the death.\n\nI think you're, that's the problem. They have to be vetted. It has to be a well vetted shelter or adoption. You know.\n\nBut the problem is oftentimes you don't know their behavior until they're around other dogs. Yeah. Like I've had dogs that were great around people. Yeah. And I get them around any dog and their hackles would go up and they immediately wanted to fight. Yeah. And you're like, oh god. And then you're the asshole. 'cause your dog is like pulling on the leash and you're like, I'm sorry. Let me get 'em outta here.\n\nRight. I know.\n\nThey, they're dangerous. They're dangerous in that regard because they really are bred to fight. And\n\nI think it takes a special household and owner too to really Yes. Kind of handle a dog like that. Like\n\n100%.\n\nOur best friends, Gwen, she's in my band and her and her husband are long time pit bull rescue family. And he, they just know how to like deal with them and they come around our dogs, they're fine, everything's fine. But it's definitely an alpha male out. Like they kind of show 'em who boss right away and Yeah. And they sort of understand the food chain of the house. You know what I mean?\n\nYeah. There's dogs that are great dogs, but they just need a lot of attention. Like if you have a German shepherd Yeah. Or a Belgium malis, you gotta give those things something to do.\n\nYeah. You gotta know what kind of breed you're getting too. Yeah. Like I feel like people, I always preach, adopt, don't shop. But I still think you within the adoption, like really need to go, I'm gonna spend some time with this dog. I'm gonna talk to his foster family. I'm gonna foster it. Just to really understand what kind of breed you're getting. If you want like a lazy, cuddly thing, but still protect or kid a Pyrenees. You know what I mean? Right. Just know what you're getting. Like just understand like as my household ready. 'cause there's a lot of the, what breaks my heart the most is the like owner surrenders and the returns Yeah. At the shelters. You know what I mean? It's like Yeah. You didn't think through what you were right doing and\n\nThen the dog already thought it had a home and now\n\nYou bring 'em in. Right. Because you did. You wanted a lazy dog and you got a cow dog and it needs to run like\n\nGreat. Pyrenees are great because they're kind of a combination of like a lab and a protector dog. Yes. They're a great little balance. Yeah. Like I have a friend who has a Pyrenees and it's like such a good dog. And he's like, listen man, if coyotes come around here, this fucking dog. Oh\n\nYeah. We're not, we're\n\nNot fo them up. Yep. I go, really? And he goes like, oh yeah. Like you, you ain't never seen a change of personality like this dog when it sees a coyote,\n\nBut then they're like laid up on the couch, the legs in air. Oh, the\n\nSweetest. Just rub my bat under your knee.\n\nHe is the best.\n\nLike a re like I have a golden who's he's the best. Unless you're a squirrel. And then he's, he's hell\n\nThen he's\n\nHe then he is a demon. Yep. Exactly. He's, he's squirrel killer. But other than that he's the sweetest boy. He's just so nice to everybody. Everybody who comes over the house, like you're my best friend.\n\nGoldens are the best.\n\nThey're so sweet.\n\nBut I love 'em all. I love 'em all. We have a chihuahua. I mean, I, I mean you, you getting a chihuahua, you know what you're getting. Yeah. Mean as hell\n\nAnd nervous.\n\nOh my God. I mean she's 16 and blind and she still tries to bite. She don't know where you are. But she's like, but I could get you,\n\n16 is old\n\nAnd blind is a bat. But\n\nYou know. Oh my god.\n\nSenior dog house over here.\n\nHave you had her since she was a baby? Yep.\n\nWow. We doctor her from a shelter when she was like eight weeks old. Aw. We got two seniors now. But seniors I've lost. I was crazy dog lady when my husband met me and I had eight rescues, like wow. It seems crazy now. But it, I have farm and land and three were Pyrenees, two golden mixes and then three little, I don't know what's, and I've lost one every year for six years. And so after this, we have two seniors left. And my husband's like, my heart can't take this. Like he never had dogs growing up. Oh, he loves dogs. But he was like, this is awful. Like ever since we met, we've lost one. 'cause they're stair step in age and Yeah. So I'm like, I need a, my heart needs a break a little bit. It's hard.\n\nYeah. It's hard when they die. It's like, it's, it's so hard. So close to them. And they only lived like to\n\nBe 15, not long enough.\n\n15 or 13. And then it's over.\n\nThey're like, put here to show us true love. I know. They really are.\n\nMeanwhile they're not, meanwhile what they are is like, that's wild. I'm in, we took wolves and turned them into bitches. That's what really, really what happened. Like I have a King Charles spaniel. You know one of those. He's the sweetest. That's my little\n\nCharlie. Is that Charlie? Okay. That's\n\nCharlie. Charlie. He is the sweetest. He's so cute. You pick him up, he just kisses your face. He's just so adorable. That was a wolf at one time.",
        "claims": [
          "Pinkies are baby mice that have not been weaned from their mother.",
          "Pinkies are sold in pet stores as food for snakes and lizards.",
          "Chickens will eat and fight over a mouse.",
          "Chickens have been observed attacking and eating mice in a chicken coop.",
          "Roosters often attack people when they perceive them as threats to hens.",
          "Roosters can be aggressive toward hens, pulling out their feathers.",
          "Roosters are often killed or rehomed for aggressive behavior.",
          "Rooster meat is tough and usually needs to be slow-cooked or made into soup.",
          "In certain communities, cockfighting remains part of local culture and gambling.",
          "In cockfighting, roosters are fitted with knives or spurs on their claws.",
          "Organizations have helped law enforcement break up chicken fighting rings.",
          "Confiscated fighting roosters are difficult to rehabilitate and reintroduce.",
          "Dog fighting is still a part of underground culture in some areas.",
          "Pit bulls are often bred and raised for fighting.",
          "Pit bulls can be very loyal and affectionate as pets.",
          "Pit bulls make up the majority of dogs in many metropolitan animal shelters.",
          "Many pit bulls are overbred or come from hoarding or fighting situations.",
          "Pit bulls can be dangerous to other dogs due to high prey drive.",
          "German Shepherds and Belgian Malinois require significant attention and activity.",
          "People often surrender dogs to shelters when they do not understand breed needs.",
          "Great Pyrenees dogs are protective and can defend against coyotes.",
          "Golden Retrievers are generally friendly and gentle dogs.",
          "Chihuahuas are known to be aggressive and nervous.",
          "King Charles Spaniels were originally bred from wolves."
        ]
      },
      {
        "transcript_chunk": "was. But that against the reality of his life and how he grew up, how he was educated, what his experiences were, who he really was as a man. There's a lot more to Goering than just looking at this going, oh, bad man Nazi. You know, he, one thing I find fascinating, when he was a kid at school, he was like one of the dumbest students in his class at a normal school. And because of his sort of continuous failure as a punishment, he got sent to military school. In military school. He was a top student because it was stuff that interested him. He comes out of school pretty much on the dawn of the first whole war, has his first military experience in the infantry as a young officer gets wounded and realizes that standing on the ground and on a battlefield is not really the right place for him. And what's interesting him is what keeps going on overhead. So he manufactures a way to get himself assigned to a, a fighter squadron is supposed to turn back up for duty with his infantry squadron. But sort of, you know, manufactures a way to keep him as associated with the fighter and learns how to become a pilot while he is doing that. And at A certain point in the war, they're losing more pilots and they train. So they go, he knows how to fly. He can be a pilot, finishes the first world war with 22 kills air to air kills. That's three times the fighting. A and he's also, because he recently passed in battle at the end of the first World War, he's in charge of the Baron v Von Richtofen, the Red Baron Squadron, which is the pinnacle of the German air force. So here he is as a young man, he's finishing that first war experience and he is a fair dinkum, which means true, he is an actual war hero. And so through the twenties he's on cigarette cards in Germany by a packet of cigarettes. And there's a picture of Herman Goring, you know? Wow. So, and he goes into that political environment, that post bizarre environment with a, a very definite belief in his country as being something special. And he wants to make a contribution to bring lifting his country out of the mare that it's, it's currently in. So he starts looking for a political connection and ends up going upstairs in a coffee house in Munich, I think it was. And hearing a fellow called Alf Hitler talk and, you know, realizes that he has a lot in common with this guy. Or he sees things and knows that Hitler was a soldier. You know, it's a funny thing we put into the movie at one point, 'cause there's a speech about Rami that Rami Mallick makes about Hitler being a failed painter and a not very good soldier. And I think the response I gave ing at the time, which is not in the film, but he talks through Hitler's actual military record. And yeah, he didn't, he didn't rise above Lance Corporal, but he turned down promotion three different times. He won an Iron Cross in 1914, and then he won a second one in 1918. And doing things that were showing such extreme courage that he was awarded the Iron Cross. And he, he delivered messages on the battlefield. He would take the messages from headquarters and take it to the frontline troops and then bring their response back. Things like that, you know. So now one point in time I had going say, you know, you call him a failed painter, but maybe he got to A certain point in his life where there were more important things to address than painting. So, you know, nuance, you know,\n\nI thought it was also fascinating that you guys delved into the fact that he was an addict.\n\nYeah. We only touch on it a little bit. Yeah. But that's, that this crazy, there's really good book blitz. I can don't remember the name. Norman Oler. Blitzed, yes. Yeah. Which gave me on a podcast, which gave a lot of information. 'cause brilliant, when, when go was arrested, he had something like 40,000 pills on him,\n\n40,000\n\nIn his car. Right. He had a, a habit of 40 to 50 a day. Right. So you look at him and you can, you can see it when you, when you know that fact and you start looking at photographs, you can see him kind of leave the planet at A certain point where he's just off his tits all the time. You know, from about 42 onwards. He doesn't really have adults' ear anymore. Bels, Himmler, hydric, they've all taken those positions. The things that he promised he could do with the look wafer didn't actually come off, you know, as strongly, they didn't know it at the time, but that's the enigma machine. Everything, the codes being broken. So no matter what they did, they were always being second guessed. So, you know, Hitler's trust of him was adjusted a little bit. And I also sort of liken it to him, knowing he's gonna get stabbed. So he just doesn't bother going to the place where he would get stabbed. You know? So he does a whole bunch of other stuff and he keeps his authority, but he's not at in the center of things anymore from that 'cause\n\nOf the pills. A big part of it,\n\nBig part of it, it's personal safety. 'cause he thinks like he's no longer has the definitive ear and trust of his leader. The pills overtake his lifestyle and he decides to, you know, interest himself in, in other things for the greater good of Germany. Like the collection of great works of art and things like that. You know. But there's a, you know, a lot of things in this story that, that are just bigger once you start looking at it and examining, they're way bigger than what we know or what we commonly understand. And that's what I was looking for, to try and find a way to, you know, understand his base motivations. And at the end of the day, he, he, you know, in his own way, he's a pure patriot, just so happens to be a sort of a, a set of beliefs or whatever that most of us in the, in a western world would call ab barrant.\n\nWow. And and you gotta take into consideration the drug aspect of the entire Nazi movement. The, all the troops were on meth. Yeah. Hitler was on opiates. I mean, Norman Oler, that book just, I, I can't recommend it enough. It's so eyeopening. 'cause you're like, well that makes sense. That's why they were so fucking psychotic. That's why\n\nThey could march through the night where\n\nThey could push three nights in a row. Yeah.\n\nThrough the, the Belgian forest.\n\nBut it's very rarely taught. This is not like when we grew up, we didn't grow up thinking that they were just drug psychotic, you know, animals that were on meth, you know, in, in tanks. And the most, the, the, that gave the people the front line, the most meth. So they had different dosages for different people depending on what they were required to do. And the tank guy got the\n\nMost meth. And if you think about ING's position, he's the one ordering the drugs. Right. How many pilots have we got? How many planes? How many missions are we doing? How many sorties Right? Do that multiplication add? 10%. For me, fucking,\n\nIt's a drug fueled war. Like probably the most drug fueled war ever. I mean, the kamikazes were using meth. And then the, the Hitler thing was, I always thought that hi hit Hitler was meth as well. But Norman was saying that he was opiates as well. Right. So just like ging. Right.\n\nThey,\n\nMaybe it was how they dealt with what they were doing. They all just stayed blasted outta their fucking head all day long.\n\nWell, I mean, look, you're surrounded by guys that have a sort of a fanatical mindset. You know, you, you're gonna wanna be awake. Yeah. You know, you don't wanna fall asleep at the wrong time if that's the group of people that you've surrounded yourself with. And that's the thing that I keep saying. It's a, it's an old cliche, but I, I think it's something that he, he really learned, you know, if you lie down with dogs, you're gonna get fleas, Herman. Yeah. You know? Yeah. But I think him cleaning up by being forced by being in a prison environment, being forced by the allies to go cold Turkey nearly killed him. He had sort of heart problems because he went from 40 or 50 a day to nothing. So, but that clarity of thought that he had after being clean for, you know, six or nine months when the trial starts, that became dangerous. Because now he's sort of got his faculties back. And his intent on breaking down this whole idea of international law as, as being ridiculous. That, you know, he's a man who served his country. He's still in a uniform. He's still like a, a, a military guy. So he's quote unquote following orders. Yeah. And, you know, they were a demo democratically elected government who then step by step dismantled democracy once they were in power.\n\nAnd the fascinating thing about this character, and the way you play him is, in the beginning, he seems like a guy on opiates. 'cause he's like so relaxed about everything. You know, it's like he doesn't seem to be carrying the weight of what's happened to him. Right. And for you to, and then there's dark moments, particularly like during the trial where you are like, whoa, there's a lot of range to this guy. And that's gotta be a weird place to be to, for you to try to put yourself in the mind of what ultimately became one of the most horrific figures in modern history.\n\nYeah. It's not comfortable. It's not comfortable, but that, that pain's part of the gig, you know? Yeah. It, it really is. And there's, you, you, you sort of learn to accept it. And I say this to people quite a lot 'cause they, you know, big question is how do you turn off, you know, when you've been a Nazi for a day, what do you do to relax?\n\nDefinitely don't do method.\n\nYeah. But the, the, you know, you ask anybody and, and you would be the same just because in a little while the podcast is over for the day, doesn't mean that that's the end of your job. Doesn't mean you're just gonna turn off and never think about it again until you're gonna, obviously, you know, anybody has a passion for the thing that they do is gonna continue the process. Five o'clock might be when the office closes, but you're gonna go home, you're gonna have dinner, you're gonna think about the deal that you're currently doing, the presentation that's ahead of you, or whatever it happens to be. You're gonna keep processing. And that's what happens when you, you're playing a character. 'cause you might have delivered x amount of dialogue today, but you've got x amount tomorrow too. So you've gotta keep that process going. So,\n\nSo you're just thinking about a Nazi\n\nAll the time, time 24 7 all the time. There's no, it's relentless. One, one description of of making a movie is that it's a train journey. It's not like a car, you know, where you can pull over and have a wee on the side of the road. It's a train journey. And once you get on that train, you're staying there until it gets to its destination. And you've just gotta accept that. I mean, and that there's, you know, good and bad. And that there's a, a, a saying that goes with this, you know, the, the best thing and the worst thing about the job that I do is that one day it's gonna finish. Always finishes. You can be having the worst time of your life, but it's gonna finish. But you can be having the greatest time, you know, have the incredible relationship with the crew and the cast and the director. But it's gonna finish. And you have to get used to that. You have to understand that.\n\nWhen, how much time did you prepare and how much time did you film for? So like how much time were you actually in the head of this Nazi? Well,\n\nI, I signed on in 2019. So\n\nYou started thinking about\n\nIt then? I thought I was going straight from loudest voice, which finished shooting around April or something like that. And I thought by the end of that year we'd be doing, you know, we would've shot that film.\n\nSo that's when you started researching it. Yeah.\n\nAnd then as it turns out, we got set up and collapsed three different times. And so I had five years, five years of, you know, scratching around trying to find little bits of information to humanize him in my mind, but also for me to try and understand him and understand the, you know, what he got. Because on it, it doesn't make a lot of sense when you read about his history and stuff. And where he gets to doesn't make a lot of sense. He was a mountain climber really. Right. When he was a young man. There are traverses and the Austrian Alps that Herman Goring was the first person to do that traverse of that peak. And you think about the mentality required of a mountaineer to stand at the base of a big ass rock and look up and say, I'm gonna keep going until I reach that summit. That says a lot about who Herman Goring really was and you know, who's Bavarian. Right. So from southern Germany. And once I, 'cause I didn't know he was a mountain climber. Once I knew that, then I started looking around for, well, what does that mean to be a mountain climber? You know, prior to the first World War, what kind of equipment would you have? And it's very basic, man. It's nothing, you know, you gotta, you're relying on your wits and your strength just completely. And yeah,\n\nThey didn't even have nylon ropes.\n\nProbably not.\n\nNo,\n\nNo. But not then. Right. Just all stretchy hemp. Oh Jesus, that's gonna be behave completely differently once it gets wet. But it gave me some real insight to him. But, and it also ended up giving me this great way of connecting to the other German guys who were playing the other Nazis. You know, because I just knew from the first day when they all arrived and they were sitting together in a group, I could see that they were already feeling the punishment of playing that kind of character. So I just brought them together and I asked them, 'cause now you know, these guys, some of them are German, some of them are Hungarian. And I said, look, you know, there's this song that I found and I'd like to learn the song together. And they all, you know, most of them knew the song. But that's what we would do every day as a group. We'd get together, we'd sing that song, and then we'd walk into court together feeling connected as a unit. You know?\n\nWhat kind of song was it?\n\nIt's called Mussi Den.\n\nIs it a German song?\n\nIt's a German song. And, well, I didn't realize when I first came across song, it's a Barbarian Mountain song. So he definitely knew that song. It's actually the melody that Elvis Presley uses for the song Wooden Heart in the movie Chi Blues Zoom. Stay late in Hal, stay late in Hal. You know, that's, but I don't have a wooden heart. That's what we're busy singing together. So\n\nYou guys would sing this to get into the character\n\nAnd you Wow. Be the calm. Yeah. So there's just a little thing just to remind that particular group of guys that we we're just actors we're just playing roles and you know, this will finish.\n\nThere's a lot of people that don't want to show a human side of a monster. Hmm.\n\nAnd which I think is very dangerous and quite stupid. You know, because it gives you a complete misunderstanding of what a monster is. You know, that. Yes. Okay. Here's somebody with, you know, horrific expert as the joke used to be. Even Hitler, you know, he used to love dogs. So that's the joke. Right. You know, and, and that, but there's some real truth in understanding the human process in that, that somebody who makes the absolute worst decision in the world can still be a loving father.\n\nMm.\n\nYou know, can still have a group of friends, but on, you know, a particular, in a particular moment that is the same person who's made this horrific decision that will have terrible effect on a, a generation of people.\n\nYeah. I mean it's, it's really the same kind of thing we were talking about with Tony Soprano.\n\nRight.\n\nLike that this, this person is a terrible person, but yet loves his kids. Right. Loves his friends. Yeah.\n\nWell, charm is one of the greatest weapons of evil. Yeah. You know, it's, it's a really, you know, it's a, it's a fun thing for us. We see somebody, you know, who can tell a story, tell a joke, hold a tension in a room. Yeah. You go, it's cool.",
        "claims": [
          "Hermann Göring became a highly decorated World War I fighter pilot with over twenty aerial victories.",
          "Hermann Göring commanded the Red Baron’s former squadron at the end of World War I.",
          "Hermann Göring’s addiction to narcotics severely affected his judgment and behavior during World War II.",
          "High-ranking Nazi officials, including military pilots, routinely used methamphetamine and other stimulants during the war.",
          "The widespread use of methamphetamine contributed to extreme endurance and aggression among Nazi troops.",
          "Hermann Göring collected valuable works of art during the Nazi era.",
          "Adolf Hitler and other Nazi leaders used methamphetamine and opiates throughout the war.",
          "The Nazi government dismantled democratic institutions after coming to power through elections.",
          "Hermann Göring experienced severe withdrawal and heart complications when forced to quit drugs after his arrest.",
          "Hermann Göring was an accomplished mountaineer before World War I.",
          "Methamphetamine and opiate use among Nazi leaders made World War II one of the most drug-fuelled conflicts in history.",
          "Portraying historical figures as purely monstrous obscures the complex human behaviors that enable evil acts."
        ]
      },
      {
        "transcript_chunk": "Joe Rogan podcast. Check\n\nOut The Joe Rogan experience.\n\nTrain by Day Joe Rogan podcast by night, all day.\n\nIt does Just because a mess. Because my mind is a mess. I wish my mind\n\nWas mess. You're creative. That's how it works.\n\nIs that how it works?\n\nYeah, I think so. Is\n\nThat the excuse we\n\nUse? I dunno. I'm trying to make myself feel better.\n\nI think that's the excuse we use for each other.\n\nYeah. You know, like, I'm a creative, it's, it's my go-to default.\n\nIs the compression on something sounds weird? Yeah. Oh, it's just really loud. Something happened. Maybe my ears got better. What happened?\n\nYou can hear now. My ears aren't very good.\n\nSometimes I, you know, when I'm underwater for too long or I swim or something like that. And then I forget that my ears have water in 'em and then they come out like, oh, there's that moment where like, oh, this is how I hear. Oh,\n\nI feel like I have the in ear monitors for my job. And\n\nOh,\n\nRight. I still, like, I've been using 'em for, I don't know, 20 years and I'm still not used to 'em. Like, I come from like honky tonk world where you can hear everything. Yeah. Hear the room.\n\nWell, it's so good that people have them now. 'cause boy, so many people I know from back in the day are almost deaf.\n\nOh yeah. We, I'm so glad we have them. It's not the same. I mean it, you don't feel the energy of the room, but save your hearing, which is\n\nHelpful. It's a good trade off. Yeah, true. I mean, you can hear it enough. It's a good trade off. Yeah. And so many of my friends who shoot guns too, same thing. Yeah. You know, they started hunting when they were kids and no ear protection back then. Yeah. And you know, you, you say something to them and they're like, what? Like they're all, they're all half\n\nDeath. Yeah. My dad was a police officer and he's, I swear that's why my parents are still married because he can't hear it all. And the dog ate his hearing aid and he never replaced it. And I'm like, is that on purpose, dad? That's\n\nHilarious. That's hilarious. Yeah. You definitely develop an ability to shut things off. Yeah. Otherwise, because men and women think and communicate differently. Yeah. And if you want your wife to communicate with you the way your buddies do, then Well, you married a dude. Yeah. Okay. So if you want to be married to a woman, you have to listen. You have to like, listen and everything with both ears. And sometimes it's like round about journey to get to the point and you can't go, what the fuck are you talking about? 'cause then they're like, oh my God, why are you so hostile? So you have to go. Okay.\n\nOkay. Selective hearing.\n\nYeah, selective hearing.\n\nBut my husband will like, I'll say it and I'll be like, say it back to me. And like, and I found that when I do that, it's worse because I'm like, I'm like, say, say what I said back to you get bananas at the store. So he comes home, I'm like, where's bananas? I didn't get any. So don't repeat it. Just hold it in there.\n\nThat's hilarious. He blocked it out for himself.\n\nYeah, exactly.\n\nThat's very funny. Yeah. The the earing thing, the hearing thing is kind of nuts that no one knew. Like, it just makes you wonder, like when did people, when I wonder when people were aware that like loud music was gonna kill your hearing.\n\nI don't know. Like, just, I mean, I, I've had the in-ears for a long time and they did save all of our ears. But it's like, I think that, and then like, the longer you go, like still, even though I have those, like I turn them up way too loud. Oh, do you? Because I'm like missing. Right. The energy. And so\n\nDo you ever, you ever just say, fuck it for this\n\nShow, take one out. Like sometimes when it's like a house band, you just get to use wedges. I'm like, yes. This is amazing. What's a wedge? It's just like the little onstage monitor. Oh, right. You know what I mean? So, but it's just so loud. I mean, it's so loud. And I also do, I do mounted shooting. And so\n\nI saw that. That's crazy.\n\nAnd so it's a good reminder. Like the first time I took off on the first, I just started last year. I'm not good at all, but I love it. And I took off on my horse and I forgot to wear ear plugs. And I was like, well, I, I'm a musician. I probably plug my ears when I'm shooting a revolver off of a horse.\n\nYeah. But it's, is it a revolver using a regular bullet? No, it's black\n\nPowder.\n\nJust the powder itself. Yep. So it's just\n\nA spectator safe horse safe.\n\nSo it just sprays, sprays\n\nPowder.\n\nPowder and air\n\nAt the balloon.\n\nAnd it pops balloons. Yeah. At how, what, what distance\n\nIt could shoot, I think 15\n\nYards. Feet. Feet. Oh, okay. Yeah. So you're just riding around the horse popping balloons.\n\nI love it. I do.\n\nWhat was the origin of that sport?\n\nI don't know. Actually, one of my best friends, her name is Ken Sane, and she lives out in Scottsdale. She's like the 10 time world champion and whoa,\n\nWhoa. Hold on. We became, there's a world championship of popping balloons on a horse. Yeah.\n\nIt's called mounted shooting. And Oh, cowboy mounted shooting. But she's cowgirl and she's like, guys', girls, everybody, she's a badass. And became friends with her. And I just never had the guts to go do it, you know? And finally my husband was like, stop talking about it and go out there and do it. Go out there and shoot with her. You're gonna love it. Wow. And I got addicted immediately. It's just like something different.\n\nWell, it's very wild west, right? Oh yeah. It's essentially training how to fight with a gun on a horse. Yeah. That's all it is.\n\nExcept it's the balloon is the Yeah. Perpetrator.\n\nBut I mean it's, that's how you would train. Yeah. It's super Right. Without killing people.\n\nIt's super fun. And it's like, you know, just something that like started a new hobby at 40. Like, it's just try to like preoccupy my mind and, and I don't know, I think it inspires me to like, take a break from thinking about what I think about every single day, which is music industry, you know? So just like trying new things and saying, what the hell, let's go for it.\n\nI think that's very good for artists. I, I try to talk to comedians about that all the time. I'm like, get pick up something, man. Yeah. Like\n\nHobbies are\n\nImportant. Play golf. Go fishing. Do something. Yeah. For me, I play pool, do something. So\n\nI just started golf too. Oh, I remember. I try new things. Era. There\n\nYou go. You try new things. Era. Yes.\n\nMy, my yes. Era. Like sure, I'll do it. Started golf. Not too great yet, but I did, I just played the Ryder Cup.\n\nOh, nice.\n\nThey had like a celebrity. Hmm. Somebody heard, I played golf and I, when they heard that, I literally started like that day.\n\nJamie's a nut and I Jamie's a full on golf nut. Like\n\nHe's literally was like cramming my ass off like this September because I was on tour all summer and I didn't have time to practice. And you know how that feels like golf is, you have to practice and do you have a\n\nCoach?\n\nI had a coach, yes. No, Dan, I have a coach and he came with me as my caddy. Very helpful. But it was, it was an experience. It was a lot of pressure. Like,\n\nDid you feel it even though like, no, it didn't expect you to win. Oh my\n\nLike, yeah. I mean I just felt like, what, what, what the hell have I done when I got there? It's like, play doing something you don't do in front of people. Right. A\n\nLot of people. But you do it, you just don't do it a lot.\n\nYeah. And I don't, I do things in front of people, but it's singing.\n\nYou do things in front of people and you're really good at it. That's the difference.\n\nWell that's the thing. Doing something that you suck at in front of people is a very scary place to be. Right.\n\nRight. Jamie has OJ Simpson's golf clubs,\n\nA couple of them. Not all of 'em. I have a few. That's\n\nAwesome. How many do you have? It's not really awesome at all. Drivers? Well, I mean, they're haunted.\n\nWhatever you're into\n\nCouple. Dr. How many you got? Three.\n\nNo, I mean I got a whole, whole set. But\n\nDo you use them?\n\nI I used one of them.\n\nD is, did you hit Well?\n\nI have, that's why I used it.\n\nWhy are they blister curse? I\n\nDunno. I mean, well, he bought it as a goof, you know.\n\nYeah. It's just fun to talk about. It's a fun\n\nJoke. Just one of those things. Conversation starter. It came up. Was it, did you get 'em after he died? Yeah,\n\nYeah. Yeah. I mean, I got 'em like six months ago. Yeah.\n\nI forgot. I forget when he died\n\nA couple years ago.\n\nWell, that's cool. I mean, I,\n\nI guess, but it is really important having some kind of a thing that you do to take your mind off of the business. 'cause the people that I know where their mind is only on show business, whatever it is, music, comedy, whatever it is, they go crazy. You, you can eventually get lost in your own little world. Yeah. Like you need a little break.\n\nYou do. And I, I think it's like, you know, especially if you're like a writer, like you gotta go live to write about it or what are you writing about? Same shit you already said. Right. You know? Right. It's like I need to go live a life and gather information and be around different people and Yeah. Sort of open my circle up to just, I don't know, different experiences. Something Yeah. A different environment. Yeah.\n\nYeah. My friend Ari does that. He disappears for like three months every year and a half or so. Like, he gets rid of his phone, gets rid of his email, he\n\nLike goes off grid.\n\nOh, he goes off grid. He goes to Asia. He backpacks through Asia and he's famous. He's a famous comedian and he doesn't give a fuck. He just goes and vanishes for like, we can't find him. No one knows where he is. I don't hear from him for like three, four months. I just hope he's alive.\n\nDoes it change him?\n\nOh yeah. He comes back weird. He's weird already. He's weird as fuck. Weirder. He's weirder when he comes back. 'cause he is, you know, been living in foreign countries for, you know, a long time. Yeah. This episode is brought to you by the farmer's dog. I think we can all agree that eating highly processed food for every meal isn't optimal. So why is processed food the status quo for dog food? Because that's what kibble is. An ultra processed food, but a healthy alternative exists. The farmer's dog. They make fresh food for dogs. And what does it look like? Real meat and vegetables that are gently cooked to retain vital nutrients and help avoid any of the bad stuff that comes with ultra processing. And it's not just random ingredients thrown together. Their food is formulated by on staff board certified vet nutritionists. These people are experts on dog nutrition and they're all in on fresh food. The farmer's dog also does something unique. They portion out the food to your dog's nutritional needs. This ensures that you don't over feed them. Making weight management easy research shows that dogs kept at a healthy weight can live up to two and a half years longer. Head to the farmer's dog.com/rogan to get 50% off your first box plus free shipping. This offer is for new customers only. This episode is brought to you by Dodge. The 2026 Dodge Durango. SRT Hellcat is all about one thing, unlocking performance with 710 horsepower, 645 pound feet of torque. And a supercharged 6.2 liter Hemi V eight under the hood. The Dodge Durango. SRT Hellcat is the most powerful SUV in the segment. It's also insanely capable towing up to 8,700 pounds with seating up to seven that's best in class muscle in a three row SUV plus. You can jailbreak it and customize the hell out of it. The SRT Hellcat Jailbreak has over 6 million possible configurations. You can customize everything from paint to wheels to badging to seats. Make it your own. This isn't a quiet SUV. It's loud, it's fast, it's powerful. And unapologetically dodge. Learn more now@dodge.com based on the latest competitive information available, I hs. Standard full size CUV segment and horsepower.\n\nWell, I'm not, I mean, I'm just shooting balloons and swinging a golf club, but I'm not, nothing as cool as that.\n\nBut the thing you're doing, the thing about both of those things is they require all of your focus while you're doing, I mean, if you're riding a giant animal while you're shooting a gun, like there's no room for thinking about, oh, I gotta do laundry. Right. You know, there's no room. You just, you're just doing that thing only.\n\nYeah. That's what, what, that's what I think I loved about it and got addicted to. Yeah. You know, and I guess I don't really have, I always say I don't have like an adrenaline junkie in me, but I guess I'd have to have a little bit for joining the circus like I did. You know, like Yes, you do.\n\nIt's kind of joining the circus. It's,\n\nYeah. So, but like, I think that just that little, that the focus and the little jolt Right. That you get of like, you know, the, the same kind of high we get like after a show, you know, it's like, right. I still guess I need that, but just in a different form.\n\nYeah. Joining the rodeo. Yeah. There's, there's something about shooting at things too. I do archery and there's something about shooting at things that also just really cleans your mind because in that moment, while you're pulling a trigger, there's no room for anything else. Yeah. If you're trying to hit a target, there's no room for anything else and it just, it pushes all that stuff away. Right. It gives you like a little, little mental vacation. Yeah.\n\nA hundred percent. And then\n\nYou come back like cleaner. What kind of\n\nBow are you shooting?\n\nI shoot a compound bow. Compound bow. Yeah. A Hoyt. Yeah.\n\nYeah. I used to shoot bows. I have a long time, but Oh really? I, I got 'em back out during 2020 when I had all the time in the world. And my husband's from New York City so I was like, I got these bows, I'll, I'll teach you how to shoot a bow. So we just set up the targets and got 'em all fixed stuff and it was fun. I mean it is fun. It's the same thing I think you're talking about.\n\nIt's very similar.\n\nIt's focus. It's just, even if it's just for a little while, it's that little moment in time that this is all I'm doing right now.\n\nRight. Have you ever bow hunted?\n\nI used to be a hunter. Yeah. Yeah. Yep. I did. I hunted for a long time. My dad tree\n\nStand. Yep.\n\nOkay. Or ground blind either way. Right. Bow hunting was my absolute favorite to, to do because it took the focus and it was intimate. Yeah. And it took a lot of skill and practice. Certainly bow hunting to make sure you're gonna Yeah. White tail. White tail. Oh\n\nNice.\n\nBut I raised a baby deer a buck. Aw,\n\nThat's a problem. Yep.\n\nThat's a problem. So my hunting days are behind me. Peace on my heart.\n\nWe found a buck with a broken leg on our property and my wife took to feeding it. Yeah. And all of her enthusiasm for me hunting kind of went out the window.\n\nIt changes things. Yeah.\n\nBecause it's kind of like a dog. Like they're,\n\nThey're they, he was just like a dog. Like they, they're sweet. A full grown,\n\nThey come right up to you. Yep.\n\nWild ass whitetail, deer like became like my pet.\n\nAnd it's different than any other feral animal in that they domesticate like that\n\nThey really do. Like he was literally, I'd come home and he would run over to me like a dog. So definitely changed my mind.\n\nWell I think it's because they're dumb. Unfortunately. I think nature has them set up to be not very intelligent and just food. Yeah. You know, and he's a beautiful food thing. Yeah. That's really what they are.\n\nYeah. My dad, my dad, you know, I grew up hunting with him, like taught me how to shoot a gun and all that stuff at 17. And when I raised that buck, he was like, it's over, isn't it? Yeah.\n\nIt's\n\nOver. It's over.\n\nIt's over. Yeah. I'll never raise a baby elk, I'll tell you that. Yeah.\n\nDon't do it. I don't love elk hunting too much.\n\nYeah. But I, I get it. I mean we have deer in our neighborhood and I see these little cute babies that are born every year and you know, we stop the car. Oh my God.\n\nEspecially so cute.",
        "claims": [
          "In-ear monitors help protect musicians' hearing.",
          "Many musicians from earlier decades have significant hearing loss.",
          "People who shoot guns without ear protection often experience hearing loss.",
          "Cowboy mounted shooting uses revolvers loaded with black powder.",
          "In cowboy mounted shooting, competitors shoot at balloons while riding horses.",
          "Black powder revolvers used in mounted shooting are considered spectator and horse safe.",
          "Black powder fired from a revolver can pop balloons from about 15 feet away.",
          "There is a world championship competition for cowboy mounted shooting.",
          "A competitor named Ken Sane from Scottsdale has won the cowboy mounted shooting world championship about ten times.",
          "Jamie Vernon owns some of O.J. Simpson’s golf clubs.",
          "Joe Rogan practices archery with a compound bow made by Hoyt.",
          "Bowhunting requires focus, skill, and practice.",
          "White-tailed deer are a common target for bowhunting.",
          "Raising a deer can cause someone to stop hunting due to emotional attachment.",
          "Deer can become tame and behave like domestic animals when raised by humans."
        ]
      },
      {
        "transcript_chunk": "paralysis tick. And they realized, she realized that between her and this other girl that looks after the, the puppy and we're not there, they'd got their dates mixed up. And so it wasn't actually covered for flea and tick, you know, stuff in its bloodstream. Mm. So very dangerous. So they had to shave the dog completely and everything. And they, they pulled off another couple of ticks, but there was only just the one paralysis tick. So it's okay. But if you leave that, and if you don't deal with it, the dog's gonna be dead in a minute.\n\nParalysis\n\nTick. Yeah. Yeah. It gets into their, into their body. And, and it is, it, it affects them the way the name says on the box, the\n\nParalysis. There's one that's going on in America now called, called the Well, what it, what it gives you. It's, it's a lone star tick is what what gives you this bite. And this produces something called Alpha Gal. And it makes you allergic to red meat. What? Yeah. It's my friend, my good friend Evan Fer. Got it. And he, he was allergic to red meat for a good solid year. And then eventually it went away. And then it came back again Recently. It's, it's a huge pain in the ass. So\n\nWe, we have ticks in Australia, but we've never had to deal with Lyme disease like you have here. Mm. But in the last, you know, four or five decades, people started raising deer in Australia for, for meat and what have you. And a few of them get away. You know, there's, there's no deer farms around where I am, which is north of Sydney by 600 Ks. But recently a couple of the guys that worked for me on the farm said they've seen deer going through the bush at the back of my block. You know, so that means that there's some just animals that have escaped, and they're most likely to have been in the southern highlands, which is south of Sydney. And somehow they've got themselves all the way up to where, where I am. How\n\nMany miles is that? Or kilometers?\n\nWell, we're probably talking about 700 something kilometers.\n\nThey just wandered. Yeah.\n\nWow. And, and didn't get run over or didn't get, you know, that's crazy.\n\nThat's\n\nAbsolutely.\n\nAnd they're probably bringing ticks,\n\nProbably and the wrong tics.\n\nYeah. In America, they have a problem with That too. Deer farms and this disease called chronic wasting disease, and it's spread throughout, large swaths of America have a giant issue with this, where deer herds get infected. My friend Doug Duran, he has a, a farm out in Wisconsin and they, they've had a significant problem with it to the point where they've started issuing more tags and thinning the herd. They're trying to kill more deer to try to lessen this spread of this stuff. Right. 'cause chronic wasting disease, it get, it's a PreOn disease, so it's like, it, it gets on plants. It has, it stays on them for a long time. So, and they start drooling when they have it. And in that drool is more chronic wasting disease. Right. So another deal will come along and graze on the ground where they drool, then they get it. Horrible, horrible disease. And a lot of it emanated from these deer farms\n\nWhen I first bought the farm, which was a hundred acres to start with, but it's now like 1700 and it's attached to a state forest as well. So I can get up behind my place and go for days. Oh wow. Which is just sort of like, you know, which is cool, but back in the day, we used to have platypus in the creeks. We had wombats, and now I see more foxes down. I see native animals, or I see an equivalent amount of foxes as I see wallabies\n\nAre foxes invasive. Yeah. Yeah. Okay.\n\nThere you go. And they're absolute, you know? Yeah. Because they eat anything and everything. Yeah. I used to have a big family of what we call bush turkeys living behind the house, and they're still there, but they used to just proudly walk around, you know? And, and it was fun. You'd going through the bush and then suddenly there's a road full of bush turkeys. It's great, you know, but now the population is right down and they're totally ninja now. You know, you don't see them very often when you do, they're like very suspicious. They checking you out, you know, he's just being\n\nHunted 24 7.\n\nIt's foxes, man.\n\nYeah. You also have a, a large feral cat problem,\n\nRight? Gigantic. Yeah, gigantic. The one and only cat that I let my mother have at the farm. This is way back man. I was training for Cinderella, man. And, you know, they sent me this group of boxes, Olympic guys and stuff like that. And every single one of 'em can smash the piss outta me in the ring. So I've gotta smash the piss outta 'em in other areas. So I train them until they drop, you know, getting them on bicycles and taking them to the bush, you know, and things like that. Just to sort of like, keep the balance, you know? Right. And this one particular day, and I had it in my mind that I was just gonna absolutely smash them. I was gonna get into this situation 'cause it's one road, you know? And I was just gonna get so far in front of them, psychologically damage them, you know what I mean?\n\nSo, and I, I just devious, yeah. Just\n\nHad a conversation with my mom and she was like, oh darling, you know, I, you know, I'd really love to have a cat. And I'm like, mom, we lived in this privileged situation. We've got sulfur, crested, cockatoos roses, king parrots, all these beautiful birds. And the worst thing that we could do for them is put a cat into that. So you can't have a cat. You know, I'm riding through the bush, 25, 30 Ks in at this point, right. I'm getting to the top of this hill. I'm looking down, I'm seeing these boys struggling quite some distance, probably about a kilometer and a half away from me, you know? And I'm going, good, I'll just have a little rest here. And I just hear this little noise and I'm like, what the hell is that? So I just take three or four steps off the road. You know, probably about seven or eight minutes ago, I was coming around this corner and a car was there on the road, which is kind of unusual for the state forest in that particular area. Right? So I take these three or four steps in and there's a little kitten sitting in the bush, like, what the hell? So I pick it up, it's warm, you know, I can't leave it here. So I, I put it in my backpack, right? And I complete the ride. I get to the top of this hill where this t trig station is, and everybody's standing around and I go, oh, I found a cat. You know? So I bring it out, everyone's, all these big boxes go, ooh, you know, cute little kitten. So I took it home to my mom. I said, okay, here's your cat. You know, and the way that I reasoned it is like, this is me saying to my mother, you cannot have something that will make you happy. And then the universe goes, listen to your mother. So, you know, that cat hated human beings for the rest of its life, you know? Wow. The only person it got on with was my mum. And we used to have like four bells around his neck. So to give the birds enough warning so it didn't cause too much damage. So\n\nWas a feral cat then,\n\nI think? Or was\n\nIt tossed outta that car?\n\nI think so, yeah.\n\nOh, it\n\nWas too clean and too warm for it to have been living. But that's what people do. That's, they have a problem. They have a cat that has a litter. They dunno how to solve it. Pet stores don't want it. Their friends don't want it. So they come up with the concept of just chucking them into the bush.\n\nWell, didn't it start out what they brought, they introduce cats to try to eliminate some other animal.\n\nWe have such a history of stupidity in that regard. Have you heard of the cane tote?\n\nYes. Yes.\n\nIt's just so fantastic. Right? Yeah. So, you know, they're growing sugar cane in Queensland and there's a particular flying creature that they want to control. So they start looking around. We always blame the British for this. 'cause it's usually, it's usually a naturalist, a British naturalist or scientist that comes up with the concept. And so they, they look through all the ahs, can't remember where they found it from, but they, they found this toad who seemed to have this appetite for this particular insect. And they would feed it, it ate at them. Great. So we'll introduce the cane toad to get amongst the sugar cane and lessen that creature. When they were checking if the cane toad would eat the creature, they were feeding it dead once. Right? It's a flying creature. Toad doesn't have a tongue like a frog. Can't catch this thing if it's flying. Oh. So, my God, it was of no use at all. Oh my God. In trying to lessen that com population. However, it became like a dominant species. And it was in Queensland, but now it's starting to come in New South Wales. So they're basically marching south. And it's a problem, man. It's, it's like a serious problem. They secrete poison. So if a dog gets interested and the toe gets afraid, the dog can sort of like sniff or lick its head, then get poisoned and that's the end of your dog, you know? But there was a period of time there where there's actually a documentary from the nineties called Cane Toads. And it sort of just points out how crazy people were getting with it. You know, people in a small country towns walking from their house to the pub, taking a cricket bat and just smacking the cane toes off the road as they went. You know, it's like all these people becoming like, you know, crazed with the idea of, of getting rid of the cane toe population. But it, it hasn't affected them. They just keep growing. How much\n\nIs the population now? How big is it?\n\nSo big? And these things, Jamie, can you do me a favor? Look up the weight of the largest cane toad that they found. Because it's, it's always a surprise. I mean, these things grow and if they're in the right environment and things that they can eat and feed on, they just get bigger and bigger. That's not the biggest. Look at this thing. Look at this thing, mate.\n\nWhoa. That's like an English bulldog.\n\nHowdy duty. It's bigger than my dog.\n\nOh my god. Bigger than one. My dogs look at his head. What is the weight on that fucker? What does it\n\nSay?\n\nThat's crazy.\n\nYep.\n\nI gotta find another one to add. Fuck me. Hold on.\n\nI gotta weight there.\n\nIt say how big\n\nThat was a record. Of course.\n\nIt's Oh, fat. That fucker is 2.7\n\nGrams. 5.8 pounds. Wow. That looks bigger than 5.8 pounds.\n\nIt does. But it might be a perspective thing either way. I said that\n\nWas the current one.\n\nOh. Show the video. Scroll up so you can see that video. Or make it larger, like when she's holding it. Yeah. It looks like about five pounds. Boy. Have you ever seen when they, there's a lot of horrible videos online where they take toads and they put 'em in a box with mice. You ever see what toads do to mice? No. You would never think that toads are ferocious. Right. You know, you'd never think that toads are basically monsters. These just giant mouth monsters that swallow mice's hole. But they do. They're super aggressive. It's crazy to watch. Jamie. I know you're gonna get one. I just had to\n\nMake sure it was worth pulling\n\nUp. Is this a good one? Yeah, but there's, there's ones where there's a bunch of 'em in boxes. See, this one is kind of weird because he's not freaking out yet.\n\nHe's being sneaky. Oh, what's that? Look at\n\nThat head. See him get excited. Look at his head. I mean, if that thing was giant, like that was a hippopotamus shaped chasing after you. Ah, look how quick that is. How did, how did he get it?\n\nHe must be closer than it\n\nLooks like. He just swallowed 'em whole. Yeah. Oh, watch how quick he does it. Yeah. This\n\nBit here. Oh, it's just one step forward and bang. Yeah,\n\nJust snap. Yeah. Go see if he could find one of them video. Oh, he just inhales them. Like, he literally inhaled him. He's got a little bit of a tongue. Oh, he, he grabbed him with the tongue first. Right? He yanked him in. Oh God. See if you can find those videos where there's a ton of them in a box.\n\nWe're getting two live feedings of the mice like this.\n\nEither way,\n\nThat's a giant bullfrog. It's not a cane to slightly different\n\nGiant African bullfrog either way. Point is they eat mice, they eat 'em whole. Right? And, and how many of 'em are now in Australia? How many million? Oh, here we go. This guy's just gonna go ham. It starts. Oh, he's gonna eat all of them. Look how gross those things are. They look so dumb. Just so mindless and, and gross.\n\nNo, I don't think he's gonna get all of 'em. Video's not long enough.\n\nHe hasn't gotten any of them. I can, what's going on here\n\nPast it,\n\nJust gathering them in a corner. Ugh.\n\nIt's, it's a creepy animal. So and so look, what are the numbers? Like, put that into perplexity\n\nCane toads.\n\nYeah. How many cane toads? Ask our sponsor, how many cane toads are in Australia? And what was the initial deposit? Like? How many They drop off that I had it,\n\nIt was only a couple hundred. And then they bred like 60,000 in 1937. And the answer for now is estimated at 200 million.\n\nMan. And that little flyer that eats the sugar cane, it's still there. Oh\n\nMy god. 200 million. Yeah.\n\nBut see, look, if you see where those that see that cluster of light blue balls, right? They basically in there, in the middle of that, that cluster is where they dropped them to start with. And look at how they've,\n\nWell they're gonna make their way across the whole\n\nCountry. Oh, there you go. 40, 49. So the white one is actually where they put them to start.\n\nWow.\n\nAnd everything else is migration.\n\nAnd by 2000, look how far they've gone. Mm. Wow. What's the plan to get rid of those things?\n\nI'm not sure that they have a cohesive plan. There's no\n\nPlan. Well, that's the problem. If they have a plan, they're gonna bring in some lizard or something. Yeah. In\n\nFrogs that's gonna end up gonna end up, you know, doing something else. Yeah. It's gonna\n\nKill everything\n\nElse. Every single time they've done that. You know, like in New Zealand for example, they introduced the goss bush as a way to have hedging instead of fences. But New Zealand's got a way higher rainfall and sunshine hours than England where it came from. So now it's just everywhere, you know. So beautiful arable farmlands just taken over by Gores. And when it grows in Australia, in New Zealand, it grows thicker and more prickly and much harder to, to deal with. We have the same thing in Australia with plants like Lantana just everywhere, all through the bush, you know, in my lifetime. So in 96 I used to be able to walk through certain areas of my property, just under tall trees with, you know, subtropical ferns and vines on the ground. Now there's many areas of my property that are just impossible. You cannot get through it anymore. 'cause it's choked out with introduced weeds.\n\nWhat is that crazy plant down south that we talked about Once that is overrun some of these forests, it's pretty beautiful, but it's also very creepy to see what it's done. Just like taken over all the trees, all the trees, all the, anything on the ground just covered wisteria. It, it's called kudzu. Kudzu. Yeah.\n\nI'll show you. I'll make sure this is the right stuff. That's\n\nWhat you're talking about? Yeah. That's it. Look at that. Right?\n\nIsn't\n\nThat nuts? Yeah.\n\nLike\n\nThat image is creepy. I mean, that's like a steaming\n\nAt the back of my place, man. I used to have that waterfalls and creeks.\n\nLook at that. It's taking over that whole building. That's crazy. Everything. Yeah. Just where'd they come from?\n\nSee, that's in Fiji.\n\nYeah, it's in the United States though. So what was it, how was it brought in?\n\nChina, Korea, Japan.\n\nOh, did people bring it in on purpose? That's\n\nWhere it's, that's where it's originated from.\n\nSorry. Right. History of us introduction introduced from Japan in 1876. Yeah. New Orleans Exposition. Oh, that's where I heard there's a lot of it. Vine was widely marketed in the southeast as an ornamental plant, and then it just took\n\nOver California.\n\nWow. It's, it's funny when people try to do that.",
        "claims": [
          "Paralysis ticks can kill dogs if not promptly removed or treated.",
          "The Lone Star tick can transmit alpha-gal syndrome, which causes an allergic reaction to red meat.",
          "Alpha-gal syndrome symptoms can persist for months or years and may recur after remission.",
          "Deer farming has introduced new tick populations into regions of Australia where they were previously uncommon.",
          "Escaped deer have expanded hundreds of kilometers from southern to northern parts of New South Wales.",
          "Chronic wasting disease is a prion disease that infects deer and can spread through saliva and contaminated plants.",
          "Foxes are an invasive predator species in Australia that threaten native wildlife populations.",
          "Feral cats contribute significantly to the decline of native bird species in Australia.",
          "Domestic cats released into the wild can become feral and disrupt local ecosystems.",
          "The cane toad was introduced to Queensland in 1935 to control agricultural pests in sugarcane fields.",
          "Cane toads failed to control the target pest because they could not catch flying insects.",
          "Cane toads secrete toxins that can kill pets and native predators.",
          "The Australian cane toad population now exceeds two hundred million individuals.",
          "Invasive species introduced to control pests often become major ecological problems themselves.",
          "New Zealand’s introduction of gorse for fencing created widespread environmental overgrowth due to favorable local conditions.",
          "The invasive plant lantana has spread widely through Australian forests and displaces native vegetation.",
          "The kudzu vine, introduced to the United States from East Asia in the nineteenth century, overgrows trees and structures and is difficult to eradicate."
        ]
      }
    ],
    "signature": {
      "instructions": "You are an expert claim extraction system analyzing podcast transcript text. Your task is to identify and extract factual, verifiable claims while filtering out opinions, speculation, and conversational filler.\n\n**ANALYSIS PROCESS:**\n1. Read through the transcript chunk carefully, identifying distinct factual assertions\n2. Distinguish between verifiable facts and subjective opinions/commentary\n3. For each potential claim, ensure it meets ALL criteria below\n4. Reformulate claims to be self-contained and verification-ready\n\n**CLAIM CRITERIA - Each claim must be:**\n- **Factual**: A statement that can be verified as true or false (not opinions, beliefs, or speculation)\n- **Self-contained**: Include full context with proper nouns; replace pronouns with specific referents (names, titles, entities)\n- **Specific**: Include relevant details like names, numbers, dates, locations when mentioned\n- **Concise**: 5-40 words maximum\n- **Declarative**: Reformulated as a clear statement, not a question or conditional\n\n**WHAT TO EXTRACT:**\n- Historical facts and events\n- Scientific/medical claims\n- Statistics and measurements\n- Biographical information\n- Named entities and their attributes\n- Specific actions taken by identified individuals/organizations\n- Verifiable relationships between entities\n\n**WHAT TO EXCLUDE:**\n- Opinions, beliefs, and subjective assessments\n- Hypothetical scenarios (\"what if\", \"could be\")\n- Questions and uncertainties\n- Conversational acknowledgments (\"yeah\", \"right\", \"I see\")\n- Vague statements without specific referents\n- Personal anecdotes without verifiable facts\n- Future predictions or speculation\n\n**OUTPUT FORMAT REQUIREMENT:**\nReturn claims as a valid JSON array using ONLY double quotes.\nFormat: [\"claim one\", \"claim two\", \"claim three\"]\n- Use double quotes (\") only - no single quotes (')\n- Ensure proper JSON escaping for quotes within claims\n- Each claim should be a complete, standalone sentence\n\n**QUALITY CHECKS:**\n- Can this claim be fact-checked against external sources?\n- Does it contain all necessary context to understand what is being claimed?\n- Is every pronoun replaced with its specific referent?\n- Is it free from opinion markers (I think, maybe, probably, seems)?",
      "fields": [
        {
          "prefix": "Transcript Chunk:",
          "description": "The podcast transcript text to analyze"
        },
        {
          "prefix": "Reasoning: Let's think step by step in order to",
          "description": "${reasoning}"
        },
        {
          "prefix": "Claims:",
          "description": "List of factual claims as JSON array with double quotes only: [\"claim1\", \"claim2\"]"
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
